app/controllers/admin/arcs_controller.rb

SELECT "arcs".* FROM "arcs"
---
  def index
    @arc=Arc.new
    @arcs=Arc.all

INSERT INTO "arcs" ("arcs_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["arcs_name", "3"], ["created_at", "2022-06-09 02:33:56.919815"], ["updated_at", "2022-06-09 02:33:56.919815"]]
---
  def create
    @arc=Arc.new(arc_params)
    if @arc.valid?
      @arc.save

SELECT "arcs".* FROM "arcs" WHERE "arcs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @arc=Arc.find(params[:id])

SELECT "arcs".* FROM "arcs" WHERE "arcs"."arc_id" = ?  [["arc_id", 4]]
---
  def update
    arc=Arc.find(params[:id])

SELECT "arcs".* FROM "arcs" WHERE "arcs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "arcs" WHERE "arcs"."id" = ?  [["id", 2]]
---
  def destroy
    arc=Arc.find(params[:id])
    arc.destroy