app/controllers/admin/genres_controller.rb

INSERT INTO "genres" ("genres_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["genres_name", "ビール"], ["created_at", "2022-06-08 06:33:46.450895"], ["updated_at", "2022-06-08 06:33:46.450895"]]
---
  def create
    @genre=Genre.new(genre_params)
    if @genre.valid?
      @genre.save

SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    @genre=Genre.find(params[:id])

SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 1]]
---
  def destroy
    genre=Genre.find(params[:id])
    genre.destroy