app/controllers/admin/items_controller.rb

  def index
    @items=Item.all
    @items = Item.page(params[:page]).per(6)
---
SELECT "items".* FROM "items"
SELECT COUNT(*) FROM "items"

  def new
    @item=Item.new
    @makers=Maker.all
    @genres=Genre.all
    @arcs=Arc.all
---
SELECT "makers".* FROM "makers"
SELECT "genres".* FROM "genres"
SELECT "arcs".* FROM "arcs"

  def create
    @item=Item.new(item_params)
    @item.save
---
INSERT INTO "items" ("item_name", "item_text", "genre_id", "maker_id", "arc_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["item_name", "プレミアムモルツ"], ["item_text", ""], ["genre_id", 1], ["maker_id", 1], ["arc_id", 2], ["created_at", "2022-06-12 01:48:37.730413"], ["updated_at", "2022-06-12 01:48:37.730413"]]

  def edit
    @item=Item.find(params[:id])
    @makers=Maker.all
    @arcs=Arc.all
    @genres=Genre.all
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "makers".* FROM "makers"
SELECT "arcs".* FROM "arcs"
SELECT "genres".* FROM "genres"

  def update
    item=Item.find(params[:id])
    item.update(item_params)
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "item_text" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["item_text", "とっても美味しいです、大好きです"], ["updated_at", "2022-06-11 07:07:49.242250"], ["id", 1]]