app/controllers/admin/makers_controller.rb

  def index
    @maker=Maker.new
    @makers=Maker.all
---
SELECT "makers".* FROM "makers"

  def create
    maker=Maker.new(maker_params)
    maker.save
---
INSERT INTO "makers" ("makers_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["makers_name", "Asahi"], ["created_at", "2022-06-09 03:34:45.335842"], ["updated_at", "2022-06-09 03:34:45.335842"]]

  def edit
    @maker=Maker.find(params[:id])
---
SELECT "makers".* FROM "makers" WHERE "makers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    maker=Maker.find(params[:id])
    maker.update(maker_params)
---
SELECT "makers".* FROM "makers" WHERE "makers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "makers" SET "makers_name" = ?, "updated_at" = ? WHERE "makers"."id" = ?  [["makers_name", "Sapporo"], ["updated_at", "2022-06-09 03:54:57.090609"], ["id", 2]]

  def destroy
    maker=Maker.find(params[:id])
    maker.destroy
---
SELECT "makers".* FROM "makers" WHERE "makers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "makers" WHERE "makers"."id" = ?  [["id", 1]]