app/views/items/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."item_id" = ?  [["item_id", 1]]
---
　          <th><h6>レビュー件数</h6></th>
　          <td><%=@item.reviews.count%></td>