app/controllers/items_controller.rb

  def index
    @items=Item.all
    @items = Item.page(params[:page]).per(6)
---
SELECT "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"

  def show
    @item=Item.find(params[:id])
    @reviews=@item.reviews
    @reviews = @item.reviews.page(params[:page]).per(3)
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."item_id" = ?  [["item_id", 1]]